var projects = [
    {
        name: "Real Time Geo Network Tracker",
        img: "img/narwhal_sample.png",
        alt: "sample image of project",
        description: "I worked to develop a near-real time network monitoring tool. This tool not only tracks connection health, but includes active location updates for Space Vehicles (SV), and near-real time weather overlays. I had great success in taking our initial lag time of 10 seconds behind real-time to 2-3 seconds behind real-time.",
        size: 2,
        status: "Completed May 2019"
    },
     {
         name: "SPARTA",
         img:"img/LM_logo.jpg",
         alt: "Lockheed Martin Logo", 
         description: "On team SPARTA (Services Pilot for Agile Reuse & Test Automation) I aided in developing and maintaining a containerized test automation suite. Our main goal was to automate the deployment of services and the initial setup and linking of these tools. Some of my task included Automating the LDAP configuration for Redmine by leveraging Selenium scripts. I also aided other teams in developing Jenkins pipelines to take logs, reformat to CSV, and ingest them into Elasticsearch. I was able to take upload times from over an hour down to ten minutes.",
         size: 4,
         status: "Retired"
    },
     { 
         name: "T.A. Franchise Tools",
         img:"img/TAFT.PNG",
         alt: "TAFT landing page",
         description: "Tech Assurance Franchise Tools is an ongoing project for my father company to develop a new way for them to connect with their franchisees. Current franchise reporting tools on the market are outdated and over priced, so I  took on this project to help in developing a simple yet secure way for franchisees to complete reporting. The photo distorts the landing page so feel free to check out the current version on my test server at <a href='https://camsforspeed.com/franchise/'>camsforspeed.com/franchise/</a>. You can explore both roles as a franchisee or as corporate. <br/><br/> Franchisee credentials: username: franch  password: password <br/> Corporate credentials: username: franchise_company  password: password",
         size: 1,
         status: "MVP released and new features continually development"
    },
     {
         name: "Tenant",
         img:"img/tenant.png",
         alt: "Tenant app screen shots",
         description: "If you have recently been looking for a new apartment then you know just how horrible the current process is. Tenant is a multi platform tool that we hope will help ease the woes of apartment shopping and improve both tenant and landlord satisfaction levels. My role in the project is to develop the Android app and user management by leveraging Firebase.",
         size: 3,
         status: "in-progress"
    }
];



    
